# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyParameterSet..::..Insert Method
FamilyParameterSet Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	FamilyParameter item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	item As FamilyParameter _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	FamilyParameter^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..FamilyParameter
# See Also
FamilyParameterSet Class
Autodesk.Revit.DB Namespace